#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
eks/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/kubernetes_eks/kubernetes_eks/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/kubernetes_eks/kubernetes_eks

To view this run in a browser, visit:
https://app.terraform.io/app/lf-tf-demo/kubernetes-2022-11-12/runs/run-QrQrNV4pMZj5mGkf

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
module.test.data.aws_iam_policy_document.ec2_bastion: Reading...
module.test.data.aws_availability_zones.default: Reading...
module.test.data.aws_iam_policy_document.ec2_bastion: Read complete after 0s [id=814054711]
module.test.aws_iam_policy.ec2_bastion: Refreshing state... [id=arn:aws:iam::949263681218:policy/test-Bibek-bastion-policy]
module.test.data.aws_availability_zones.default: Read complete after 0s [id=us-east-1]
module.test.module.dev_ec2.data.aws_ami.image: Reading...
module.test.module.vpc_demo.aws_vpc.vpc: Refreshing state... [id=vpc-0765bd9ed9fc45539]
module.test.module.dev_ec2.aws_iam_role.ec2: Refreshing state... [id=bibek_bastion_host]
module.test.module.dev_ec2.data.aws_ami.image: Read complete after 0s [id=ami-061dbd1209944525c]
module.test.module.dev_ec2.aws_iam_instance_profile.ec2: Refreshing state... [id=bibek_bastion_host]
module.test.aws_iam_role_policy_attachment.policy_attachment_1: Refreshing state... [id=bibek_bastion_host-20221119112219561600000001]
module.test.module.vpc_demo.aws_internet_gateway.ig: Refreshing state... [id=igw-046ad2d4cb612a1e7]
module.test.module.vpc_demo.aws_route_table.private: Refreshing state... [id=rtb-0aac5d7941d6b5acd]
module.test.module.vpc_demo.aws_route_table.public: Refreshing state... [id=rtb-06e14d691cd6e618a]
module.test.module.vpc_demo.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0edf94fc713fa0014]
module.test.module.vpc_demo.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0a11c08e666059d03]
module.test.module.vpc_demo.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0a8dd059659542edc]
module.test.module.vpc_demo.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-0b74547f75131c6cc]
module.test.module.dev_ec2.aws_security_group.ec2: Refreshing state... [id=sg-09b91bdb42be6ddae]
module.test.module.vpc_demo.aws_eip.nat_eip: Refreshing state... [id=eipalloc-07fc7564b830c753b]
module.test.module.vpc_demo.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-06e14d691cd6e618a1080289494]
module.test.module.vpc_demo.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b337cc66709c3909]
module.test.module.vpc_demo.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-047008329e0edebc7]
module.test.module.vpc_demo.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0aea6a1bdf6d02c2d]
module.test.module.vpc_demo.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-073e6412ffb876d9a]
module.test.module.vpc_demo.aws_nat_gateway.nat: Refreshing state... [id=nat-045cc07efe379cd60]
module.test.module.vpc_demo.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0aac5d7941d6b5acd1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.test.module.dev_ec2.aws_eip.elastic_ip[0] will be created
  + resource "aws_eip" "elastic_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all             = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + vpc                  = true
    }

  # module.test.module.dev_ec2.aws_instance.ec2 will be created
  + resource "aws_instance" "ec2" {
      + ami                                  = "ami-08ad748ca6d229b62"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "bibek_bastion_host"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "bibek-lf-training"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0a11c08e666059d03"
      + tags                                 = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all                             = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-09b91bdb42be6ddae",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = (known after apply)
        }
    }

  # module.test.module.eks_cluster_public.aws_eks_cluster.default will be created
  + resource "aws_eks_cluster" "default" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "test-eks-public"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all                  = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + version                   = "1.24"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-0a11c08e666059d03",
              + "subnet-0b74547f75131c6cc",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.test.module.eks_cluster_public.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-eks-public-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all              = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.test.module.eks_cluster_public.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "test-eks-public-role"
    }

  # module.test.module.eks_cluster_public.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "test-eks-public-role"
    }

  # module.test.module.eks_ng_public.aws_eks_node_group.default_node will be created
  + resource "aws_eks_node_group" "default_node" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "test-eks-public"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "test-test-ng-public"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0a11c08e666059d03",
          + "subnet-0b74547f75131c6cc",
        ]
      + tags                   = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all               = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + version                = "1.24"

      + remote_access {
          + ec2_ssh_key = "bibek-lf-training"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # module.test.module.eks_ng_public.aws_iam_role.default_node will be created
  + resource "aws_iam_role" "default_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-test-ng-public-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + tags_all              = {
          + "Creator"   = "Bibek"
          + "Deletable" = "false"
          + "Name"      = "Bibek-test"
          + "Project"   = "DocVocate"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "test-test-ng-public-role"
    }

  # module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "test-test-ng-public-role"
    }

  # module.test.module.eks_ng_public.aws_iam_role_policy_attachment.node-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "test-test-ng-public-role"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_public_ip = "54.221.214.30" -> (known after apply)

```
</details>
*Pushed by: @deesirouss, Action: `pull_request`*